# St7SetCombinedLSACombinationName

Sets the name of the specified linear load case combination for user-generated .LSA files.

long St7SetCombinedLSACombinationName(long uID, long CaseNum, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Load case combination number.

CaseName

Name of the specified load case combination.